import {HttpErrorsTranslations} from '../../types/Translations'

const translations: HttpErrorsTranslations = {
    go_back: 'Вернуться',
    code401: {
        toast: 'Произошла ошибка авторизации. Пожалуйста, войдите в личный кабинет снова.',
    },
    code403: {
        title: 'Доступ запрещён',
        message: 'Доступ запрещён',
        toast: 'Доступ к запрошенным данным запрещён.',
    },
    code404: {
        title: 'Страница не найдена',
        message: 'Страница не найдена',
        toast: 'Запрошенные данные не найдены в базе данных.',
    },
    code408: {
        toast: 'Превышено время ожидания ответа от сервера. Попробуйте выполнить действие ещё раз.',
    },
    code419: {
        toast: 'Страница устарела. Пожалуйста, перезагрузите страницу.',
    },
    code422: {
        toast: 'Получены некорректные данные.',
    },
    code426: {
        toast: 'Обнаружена устаревшая версия личного кабинета. Страница будет перезагружена для обновления.',
    },
    code429: {
        toast: 'Превышено количество запросов к серверу за 1 минуту. Попробуйте выполнить действие через минуту.',
    },
    code4xx: {
        toast: 'Запрос был отклонён сервером. Попробуйте перезагрузить страницу и выполнить действие снова.',
    },
    code500: {
        title: 'Произошла внутренняя ошибка',
        message: 'Произошла внутренняя ошибка.<br>Администрация оповещена.<br>Попробуйте выполнить действие позже.',
        toast: 'Произошла внутренняя ошибка. Администрация оповещена. Попробуйте выполнить действие позже.',
    },
    unknown: {
        toast: 'Произошла неопознанная ошибка при обработке запроса.',
    },
    js_error: {
        title: 'Произошла ошибка при отображении данных.',
        message: 'Произошла ошибка при отображении данных.<br>Администрация оповещена.<br>Попробуйте выполнить действие позже.',
        toast: 'Произошла ошибка при отображении данных. Администрация оповещена. Попробуйте выполнить действие позже.',
    },
    code503: {
        title: 'Ведется техобслуживание',
        message: 'Ведется техобслуживание',
        toast: 'Ведется техобслуживание. Попробуйте выполнить действие позже.',
    },
    code501: {
        toast: 'Невозможно выполнить действие: сервер отклонил запрос. Попробуйте перезагрузить страницу и выполнить действие снова.',
    },
    code502: {
        toast: 'Сервер не отвечает на запросы. Попробуйте выполнить действие позже.',
    },
    code504: {
        toast: 'Сервер не отвечает на запросы. Попробуйте выполнить действие позже.',
    },
    code5xx: {
        toast: 'Произошла неизвестная ошибка при выполнении запроса к серверу. Попробуйте выполнить действие позже.',
    },
    axios: {
        toast: 'Не удалось отправить запрос: произошла неожиданная ошибка при подготовке запроса к отправке. Попробуйте перезагрузить страницу и выполнить действие снова.',
    },
    response_parsing: {
        toast: 'Не удалось обработать ответ от сервера: неправильный формат полученных данных. Попробуйте перезагрузить страницу и выполнить действие снова.',
    },
}

export default translations
